Revit 2027 API
Dimension.AreSegmentsEqual Property
Indicates if all segments are forced to be equal.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AreSegmentsEqual { get; set; }
Public Property AreSegmentsEqual As Boolean
	Get
	Set
public:
property bool AreSegmentsEqual {
	bool get ();
	void set (bool value);
}
member AreSegmentsEqual : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the dimension is non-linear or has only one segment.
Remarks
This property is usable only for linear dimensions with more than one segment.
See Also
Reference
Dimension Class
Autodesk.Revit.DB Namespace